STMicroelectronics/fp-sns-allmems1/Projects/STM32F446ME-BlueCoin/Applications/ALLMEMS1/Src/sensor_service.c
  uint8_t buff[2+1*AUDIO_CHANNELS]; /* BlueCoin has 4 Mics */

  STORE_LE_16(buff  ,(HAL_GetTick()>>3));
  for(Counter=0;Counter<AUDIO_CHANNELS;Counter++) {
    buff[2+Counter]= Mic[Counter]&0xFF;
  }
    
  ret = ACI_GATT_UPDATE_CHAR_VALUE(HWServW2STHandle, AudioLevelCharHandle, 0, 2+AUDIO_CHANNELS,buff);
  
  if (ret != BLE_STATUS_SUCCESS){
    if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)){
      BytesToWrite = sprintf((char *)BufferToWrite, "Error Updating Mic Char\r\n");
      Stderr_Update(BufferToWrite,BytesToWrite);
    }
    return BLE_STATUS_ERROR;
  }
  return BLE_STATUS_SUCCESS;	
}

/**
 * @brief  Update battery info characteristic value
 * @param  None
 * @retval tBleStatus   Status
 */
tBleStatus BatteryInfoUpdate(uint32_t voltage, ChrgStatus_t BattStatus, uint32_t soc)
{
  tBleStatus ret;
  static uint32_t Status;

  uint8_t buff[2+2+2+2+1];

  STORE_LE_16(buff  ,(HAL_GetTick()>>3));
  STORE_LE_16(buff+2,soc*10);
  STORE_LE_16(buff+4,voltage);
  STORE_LE_16(buff+6,0x8000);
  
  if(soc < 15)
  {
    /* if it's < 15% Low Battery*/
    Status = 0x00; /* Low Battery */
  }
  else
  {
    switch(BattStatus)
    {
    case CHRG_STATUS_DISCHARGING:
      Status = 0x01; /* Discharging */
      break;
    case CHRG_STATUS_EOC:
      Status = 0x02; /* Plagged Not Charging */
      break;
    case CHRG_STATUS_CHARGING:
      Status = 0x03; /* Charging */
      break;
    default:
      /* Nothing to do */
      break;
    }
  }
  
  buff[8] = Status;

  ret = aci_gatt_update_char_value(HWServW2STHandle, BatteryFeaturesCharHandle, 0, 2+2+2+2+1,buff);

  if (ret != BLE_STATUS_SUCCESS){
    if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)){
      BytesToWrite = sprintf((char *)BufferToWrite, "Error Updating GG Char\r\n");
      Stderr_Update(BufferToWrite,BytesToWrite);
    } else {
      ALLMEMS1_PRINTF("Error Updating GG Char\r\n");
    }
    return BLE_STATUS_ERROR;
  }
  return BLE_STATUS_SUCCESS;
}

/* Code for AcousticSL integration - Start Section */

/**
 * @brief  Update Microphones characteristic values
 * @param  uint16_t Angle
 * @retval tBleStatus   Status
 */
tBleStatus AudioSourceLocalization_Update(uint16_t Angle)
{  
  tBleStatus ret;
  
  uint8_t buff[2+2];

  STORE_LE_16(buff  ,(HAL_GetTick()>>3));
  STORE_LE_16(buff+2  ,Angle);
    
  ret = ACI_GATT_UPDATE_CHAR_VALUE(HWServW2STHandle, AudioSourceLocalizationCharHandle, 0, 2+2, buff);

  if (ret != BLE_STATUS_SUCCESS){
    if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_ERR)){
      BytesToWrite = sprintf((char *)BufferToWrite, "Error Updating Mic Audio Source Localization Data Char\r\n");
      Stderr_Update(BufferToWrite,BytesToWrite);
    }
    return BLE_STATUS_ERROR;
  }
  return BLE_STATUS_SUCCESS;	
}
/* Code for AcousticSL integration - End Section */

/**
 * @brief  Puts the device in connectable mode.
 * @param  None 
 * @retval None
 */
void setConnectable(void)
{  
  char local_name[8] = {AD_TYPE_COMPLETE_LOCAL_NAME,NodeName[1],NodeName[2],NodeName[3],NodeName[4],NodeName[5],NodeName[6],NodeName[7]};
  uint8_t manuf_data[25];
  
//  uint8_t manuf_data[26] = {
//    2,0x0A,0x00 /* 0 dBm */, // Trasmission Power
//    //8,0x09,NAME_BLUEMS, // Complete Name
//    8,0x09,NodeName[1],NodeName[2],NodeName[3],NodeName[4],NodeName[5],NodeName[6],NodeName[7], // Complete Name
//    13,0xFF,0x01/*SKD version */,
//    0x03,
//    0x00 /* AudioSync+AudioData */,
//    0xE0 /* ACC + Gyro + Mag + Environmental + Battery Info */,
//    0x00 /*  Hardware Events + MotionFX + SD Card Logging */,
//    0x00, /*  */
//    0x00, /* BLE MAC start */
//    0x00,
//    0x00,
//    0x00,
//    0x00,
//    0x00, /* BLE MAC stop */
//  };
  
  /* Filling Manufacter Advertise data */
  manuf_data[0 ] = 8U;
  manuf_data[1 ] = 0x09U;
  manuf_data[2 ] = NodeName[1];/* Complete Name */
  manuf_data[3 ] = NodeName[2];
  manuf_data[4 ] = NodeName[3];
  manuf_data[5 ] = NodeName[4];
  manuf_data[6 ] = NodeName[5];
  manuf_data[7 ] = NodeName[6];
  manuf_data[8 ] = NodeName[7];           
  manuf_data[9 ] = 15U;
  manuf_data[10] = 0xFFU;
  manuf_data[11] = 0x30U;/* STM Manufacter AD */
  manuf_data[12] = 0x00U;
#ifdef BLE_MANAGER_SDKV2
  manuf_data[13] = 0x02U;
#else /* BLE_MANAGER_SDKV2 */
  manuf_data[13] = 0x01U;
#endif /* BLE_MANAGER_SDKV2 */
  manuf_data[14] = 0x03U; /* Board Type - Board ID*/
#ifdef BLE_MANAGER_SDKV2
  manuf_data[15] = FIRMWARE_ID; /* Firmware ID */
#else /* BLE_MANAGER_SDKV2 */
  manuf_data[15] = 0x00U;
#endif /* BLE_MANAGER_SDKV2 */
  manuf_data[16] = 0x03U; /* Option Byte */
  manuf_data[17] = 0x00U; /* Option Byte */
  manuf_data[18] = 0x00U; /* Option Byte */
  
  /* BLE MAC */
  manuf_data[19] = bdaddr[5];
  manuf_data[20] = bdaddr[4];
  manuf_data[21] = bdaddr[3];
  manuf_data[22] = bdaddr[2];
  manuf_data[23] = bdaddr[1];
  manuf_data[24] = bdaddr[0];

#ifndef BLE_MANAGER_SDKV2
  /* Mic */
  manuf_data[16] |= 0x04; 
  
  /* Battery Present */
  manuf_data[17] |= 0x02; 

  /* One Temperature value*/
  manuf_data[17] |= 0x04; 

  /* Pressure value*/
  manuf_data[17] |= 0x10; 

  /* Code for AcousticBF integration - Start Section */
  if(TargetBoardFeatures.AcousticBFIsInitalized) {    
    /* Beamforming control */
    manuf_data[18] |=0x08;    
  }
  /* Code for AcousticBF integration - End Section */
  
  /* DS3 DIL24  present*/
  if(TargetBoardFeatures.HWAdvanceFeatures) {    
    /* Accelerometer Events */
    manuf_data[18] |=0x04;    
  }
  
  /* Code for MotionFX integration - Start Section */
  if(TargetBoardFeatures.MotionFXIsInitalized) {
    /* Sensor Fusion */
    manuf_data[18] |= 0x01;
    /* ECompass */
    manuf_data[19] |= 0x40;
  }
  /* Code for MotionFX integration - End Section */

  /* Code for MotionAR integration - Start Section */
  if(TargetBoardFeatures.MotionARIsInitalized) {
    manuf_data[19] |= 0x10;
  }
  /* Code for MotionAR integration - End Section */

  /* Code for BlueVoice integration - Start Section */
  if(TargetBoardFeatures.AudioBVIsInitalized) {
    manuf_data[16] |= 0x48; /* AudioSync+AudioData */
  }
  /* Code for BlueVoice integration - End Section */
  
  /* Code for AcousticSL integration - Start Section */
  if(TargetBoardFeatures.AcousticSLIsInitalized) {
    manuf_data[16] |= 0x10;
  }
  /* Code for AcousticSL integration - End Section */
#endif /* BLE_MANAGER_SDKV2 */
  
  /* disable scan response */
  hci_le_set_scan_resp_data(0,NULL);
  aci_gap_set_discoverable(ADV_IND, 0, 0,
                           RANDOM_ADDR,
                           NO_WHITE_LIST_USE,
                           sizeof(local_name), local_name, 0, NULL, 0, 0);

