STMicroelectronics/fp-sns-allmems1/Projects/STM32F446ME-BlueCoin/Applications/ALLMEMS1/Src/sensor_service.c
        switch(Data) {
        case W2ST_COMMAND_SL_HIGH:
          SetConfig_SL(SENSITIVITY_SL_HI_THRESHOLD);
          break;
        case W2ST_COMMAND_SL_LOW:
          SetConfig_SL(SENSITIVITY_SL_LOW_THRESHOLD);
          break;
        }
        
        break;
      }
    break;
    /* Code for AcousticSL integration - End Section */
    
    /* Code for AcousticBF integration - Start Section */
    case FEATURE_MASK_BEAMFORMING:
       if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_BF))
       {
          switch (Command) {
            case W2ST_COMMAND_BF_TYPE:
              switch(Data) {
              case W2ST_COMMAND_BF_ASR_READY: 
                BeamFormingSetType(BF_ASR_READY);
                break;
              case W2ST_COMMAND_BF_STRONG:
                #ifndef STM32F401xE
                BeamFormingSetType(BF_STRONG);
                #endif /* ((!defined(STM32F401xE)) || (!defined(STM32F446xx))) */
                break;
              default:
                BeamFormingSetType(BF_ASR_READY);
              }
              break;
            case W2ST_COMMAND_BF_TOGGLE:
              switch(Data) {
                case W2ST_COMMAND_BF_ON:
                  BF_toggleFlag = TRUE;
                  DeInitMics();
                  InitMics(AUDIO_SAMPLING_FREQUENCY, BV_AUDIO_VOLUME_VALUE, PCM_AUDIO_IN_SAMPLES);
                  #ifdef STM32_NUCLEO
                  BV_SetInForBF();
                  #endif /* STM32_NUCLEO */
                  
                  BSP_LED_Off(LED1);
                  BSP_LED_Off(LED2);
                  BSP_LED_On(LED3);
                  BSP_LED_Off(LED4);
                  BSP_LED_Off(LED5);
                  BSP_LED_Off(LED6);
                  BSP_LED_Off(LED7);
                  BSP_LED_Off(LED8);
                  BF_dir = 3; //RIGHT
                  BeamFormingDirectionSetup(BF_dir);
                  ALLMEMS1_PRINTF("\tW2ST_COMMAND_BF_ON\n\r");
                  break;
                case W2ST_COMMAND_BF_OFF:
                  BF_toggleFlag = FALSE;
                  DeInitMics();
    /* Code for AcousticSL integration - Start Section */
                  if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_SL))
                  {
                    InitMics(AUDIO_SAMPLING_FREQUENCY, BV_AUDIO_VOLUME_VALUE, PCM_AUDIO_IN_SAMPLES);
                  }
                  else
    /* Code for AcousticSL integration - End Section */
                  {
                    InitMics(BV_AUDIO_SAMPLING_FREQUENCY, BV_AUDIO_VOLUME_VALUE, BV_PCM_AUDIO_IN_SAMPLES);
                  }
                  #ifdef STM32_NUCLEO
                  BV_SetOutForBF();
                  #endif /* STM32_NUCLEO */
           
                  BSP_LED_Off(LED1);
                  BSP_LED_Off(LED2);
                  BSP_LED_Off(LED3);
                  BSP_LED_Off(LED4);
                  BSP_LED_Off(LED5);
                  BSP_LED_Off(LED6);
                  BSP_LED_Off(LED7);
                  BSP_LED_Off(LED8);
                  ALLMEMS1_PRINTF("\tW2ST_COMMAND_BF_OFF\n\r");
                  break;
              }
              break;
              case W2ST_COMMAND_BF_CHANGEDIR:
              if(BF_toggleFlag == TRUE){
              switch(Data) {
                case W2ST_COMMAND_BF_DIR1:
                  BF_dir = 1;
                  //2,4 - bl,tl
                  //1,3 - br,tr         
                  BSP_LED_On(LED1);
                  BSP_LED_Off(LED2);
                  BSP_LED_Off(LED3);
                  BSP_LED_Off(LED4);
                  BSP_LED_Off(LED5);
                  BSP_LED_Off(LED6);
                  BSP_LED_Off(LED7);
                  BSP_LED_Off(LED8);
                  break;
                case W2ST_COMMAND_BF_DIR2:
                  BF_dir = 2;
                  //2,3 - bl,tr             
                  BSP_LED_Off(LED1);
                  BSP_LED_On(LED2);
                  BSP_LED_Off(LED3);
                  BSP_LED_Off(LED4);
                  BSP_LED_Off(LED5);
                  BSP_LED_Off(LED6);
                  BSP_LED_Off(LED7);
                  BSP_LED_Off(LED8);
                  break;
                case W2ST_COMMAND_BF_DIR3:
                  BF_dir = 3;
                  //4,3 - tl,tr
                  //2,1 - bl,br
                  BSP_LED_On(LED3);
                  BSP_LED_Off(LED2);
                  BSP_LED_Off(LED1);
                  BSP_LED_Off(LED4);
                  BSP_LED_Off(LED5);
                  BSP_LED_Off(LED6);
                  BSP_LED_Off(LED7);
                  BSP_LED_Off(LED8);
                  break;
                case W2ST_COMMAND_BF_DIR4:
                  BSP_LED_On(LED4);
                  BF_dir = 4;
                  //4,1 - tl,br
                  BSP_LED_Off(LED2);
                  BSP_LED_Off(LED3);
                  BSP_LED_Off(LED1);
                  BSP_LED_Off(LED5);
                  BSP_LED_Off(LED6);
                  BSP_LED_Off(LED7);
                  BSP_LED_Off(LED8);
                  break;
                case W2ST_COMMAND_BF_DIR5:
                  BSP_LED_On(LED5);
                  BF_dir = 5;
                  //3,1 - tr,br
                  //4,2 - tl,bl
                  BSP_LED_Off(LED2);
                  BSP_LED_Off(LED3);
                  BSP_LED_Off(LED4);
                  BSP_LED_Off(LED1);
                  BSP_LED_Off(LED6);
                  BSP_LED_Off(LED7);
                  BSP_LED_Off(LED8);
                  break;
                case W2ST_COMMAND_BF_DIR6:
                  BSP_LED_On(LED6);
                  BF_dir = 6;
                  //3,2 - tr,bl
                  BSP_LED_Off(LED2);
                  BSP_LED_Off(LED3);
                  BSP_LED_Off(LED4);
                  BSP_LED_Off(LED5);
                  BSP_LED_Off(LED1);
                  BSP_LED_Off(LED7);
                  BSP_LED_Off(LED8);
                  break;
                case W2ST_COMMAND_BF_DIR7:
                  BF_dir = 7;
                  //1,2 - br,bl
                  //3,4 - tr,tl
                  BSP_LED_On(LED7);
                  BSP_LED_Off(LED2);
                  BSP_LED_Off(LED3);
                  BSP_LED_Off(LED4);
                  BSP_LED_Off(LED5);
                  BSP_LED_Off(LED6);
                  BSP_LED_Off(LED1);
                  BSP_LED_Off(LED8);
                  break;
                case W2ST_COMMAND_BF_DIR8:
                  BSP_LED_On(LED8);
                  BF_dir = 8;
                  //1,4 - br,tl
                  BSP_LED_Off(LED2);
                  BSP_LED_Off(LED3);
                  BSP_LED_Off(LED4);
                  BSP_LED_Off(LED5);
                  BSP_LED_Off(LED6);
                  BSP_LED_Off(LED7);
                  BSP_LED_Off(LED1);
                  break;
              }
              BeamFormingDirectionSetup(BF_dir);
              }
              break; 
          }
       }//if check BF
    break;
   /* Code for AcousticBF integration - End Section */
    
    case FEATURE_MASK_SENSORFUSION_SHORT:
      /* Sensor Fusion */
      switch (Command) {
        case W2ST_COMMAND_CAL_STATUS:
#ifdef ALLMEMS1_DEBUG_CONNECTION
          if(W2ST_CHECK_CONNECTION(W2ST_CONNECT_STD_TERM)) {
            BytesToWrite =sprintf((char *)BufferToWrite,"Calibration STATUS Signal For Features=%lx\n\r",FeatureMask);
            Term_Update(BufferToWrite,BytesToWrite);
          } else {
            ALLMEMS1_PRINTF("Calibration STATUS Signal For Features=%lx\n\r",FeatureMask);
          }
#endif /* ALLMEMS1_DEBUG_CONNECTION */
          /* Replay with the calibration status for the feature */
          /* Control the calibration status */
          {
            Config_Notify(FeatureMask,Command,isCal ? 100: 0);
            
